list_num=\
    [
        34,35,767,242,12,76,234,7,56,45,134,65,13,76,219
    ]
         #воходные данные в списке состоящие из разных чисел.

l_num_max=[] #список, куда будут попадть максимальные числа.


# В заданом списки нужно вывести лишь максимальные числа. Не используя сортировки пузырька и других функций или методов сортировки.

def find_max(num_max):  #создана функция с атрибутом.
    while True:  #запускается цикл
        for i in range(num_max): #итерация последовательности заданого числа которое выступает в качестве атрибута функции. Которое нужно найти колличество максимальные чисел.
            l_num_max.append(max(list_num))  # добавляет в отдельные список максимальное число, из входного списка.
            list_num.remove(max(list_num))   # удаляет максимальное число из основного списка которое добавили в отдельные список.
        if len(l_num_max) == num_max: break  # проверяет, равна ли длина отдельного списка заданым числом которое выступало в качестве атрибута функции. После чего прерывает цикл.
    print(*l_num_max) #выводит максимальных числа.
    
find_max(4)
